app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "admins" WHERE "admins"."userid" = ? AND "admins"."password" = ?  [["userid", "ADMIN"], ["password", "f"]]
---
  def login
    if request.post?
      admin = Admin.where(userid: params[:userid], password: Digest::SHA256.hexdigest(params[:password])[50])
      if admin.count > 0