app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    if session[:adminuserid] != "" and session[:adminuserid] != nil
      @products = Product.all

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?)
---
  def create
    if session[:adminuserid] == "" or session[:adminuserid] == nil
      redirect_to "http://localhost:3000/401"
    end
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save