app/controllers/shopper_controller.rb

SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "BMW"], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ?  [["userId", "jenil"]]
SELECT "orders".* FROM "orders" WHERE "orders"."userId" = ?  [["userId", "shalin"]]
SELECT "orders".* FROM "orders" WHERE "orders"."userId" = ?  [["userId", "jenil"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
SELECT "products".* FROM "products"
---
  def index
    if session[:userid] != nil and session[:userid] != ""
      if params[:search] == "Search" and params[:searchField] != ""
        @products = Product.where("description LIKE ? or name LIKE ?","%" + params[:searchField] + "%","%" + params[:searchField] + "%")
        @userCart = Cart.where(userId: session["userid"])
        @orders = Order.where(userId: session["userid"])
        @orderIds = Array.new
        @orders.each do |o|
          @orderIds.append(o.orderid)
        end
        @orderIds.uniq!
      else
        if (params[:logout] == "Logout")
          redirect_to "http://localhost:3000/shopper/logout"
        end
        if (params[:reviewCart] == "Review Cart")
          redirect_to "http://localhost:3000/shopper/cart"
        end
        if (params[:emptyCart] == "Empty Cart")
          Cart.where(userId: session["userid"]).destroy_all
        end
        if (params[:productName] == nil and params[:cartItemProductName] == nil)
          @products = Product.all
          @userCart = Cart.where(userId: session["userid"])
          @orders = Order.where(userId: session["userid"])
          @orderIds = Array.new
          @orders.each do |o|

SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ? AND "carts"."productName" = ? LIMIT ?  [["userId", "jenil"], ["productName", "BMW"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "carts" WHERE "carts"."userId" = ? AND "carts"."productName" = ?  [["userId", "jenil"], ["productName", "BMW"]]
---
          end
          @orderIds.uniq!
        elsif (params[:productName] != nil)
          cartRecord = Cart.where(userId: session["userid"], productName:params[:productName])
          if cartRecord.count == 0

UPDATE "carts" SET "quantity" = ?, "cost" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 2], ["cost", 90800.0], ["updated_at", "2022-12-08 03:39:48.500832"], ["id", 2]]
INSERT INTO "carts" ("userId", "productName", "quantity", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["userId", "jenil"], ["productName", "BMW"], ["quantity", 1], ["cost", 45400.0], ["created_at", "2022-12-08 03:02:00.079046"], ["updated_at", "2022-12-08 03:02:00.079046"]]
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ? AND "carts"."productName" = ? LIMIT ?  [["userId", "jenil"], ["productName", "BMW"], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "cost" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 2], ["cost", 90800.0], ["updated_at", "2022-12-09 00:30:14.491337"], ["id", 6]]
---
            cartObject.productName = params[:productName]
            cartObject.cost = params[:cost]
            cartObject.quantity = 1
            cartObject.save
          else
            cartObject = Cart.find_by(userId: session["userid"], productName:params[:productName])
            cartObject.quantity = cartObject.quantity + 1
            cartObject.cost = cartObject.cost + params[:cost].to_f
            cartObject.save

SELECT "orders".* FROM "orders" WHERE "orders"."userId" = ?  [["userId", "jenil"]]
---
          @userCart = Cart.where(userId: session["userid"])
          @orders = Order.where(userId: session["userid"])
          @orderIds = Array.new
          @orders.each do |o|

SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "BMW"], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ? AND "carts"."productName" = ? LIMIT ?  [["userId", "jenil"], ["productName", "BMW"], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "cost" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 2], ["cost", 90800.0], ["updated_at", "2022-12-08 03:39:48.500832"], ["id", 2]]
---
          end
          @orderIds.uniq!
        elsif (params[:cartItemProductName] != nil)
          productObject = Product.find_by(name: params[:cartItemProductName])
          if (params[:addItem] == "+")
            cartObject = Cart.find_by(userId: session["userid"], productName:params[:cartItemProductName])
            cartObject.quantity = cartObject.quantity + 1
            cartObject.cost = cartObject.cost + productObject.price
            cartObject.save
          elsif (params[:removeItem] == "-")
            cartObject = Cart.find_by(userId: session["userid"], productName:params[:cartItemProductName])

UPDATE "carts" SET "quantity" = ?, "cost" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 1], ["cost", 45400.0], ["updated_at", "2022-12-08 03:39:50.181426"], ["id", 2]]
---
            else
              cartObject.quantity = cartObject.quantity - 1
              cartObject.cost = cartObject.cost - productObject.price
              cartObject.save

SELECT "orders".* FROM "orders" WHERE "orders"."userId" = ?  [["userId", "jenil"]]
---
          @userCart = Cart.where(userId: session["userid"])
          @orders = Order.where(userId: session["userid"])
          @orderIds = Array.new
          @orders.each do |o|

SELECT COUNT(*) FROM "shoppers" WHERE "shoppers"."userid" = ? AND "shoppers"."password" = ?  [["userid", "shalin"], ["password", "e"]]
---
  def login
    if request.post?
      shoppers = Shopper.where(userid: params[:userid], password: Digest::SHA256.hexdigest(params[:password])[50])
      if shoppers.count > 0

INSERT INTO "shoppers" ("name", "userid", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "shalin"], ["userid", "shalin"], ["password", "e"], ["email", "shalin@gmail.com"], ["created_at", "2022-12-04 05:28:28.966276"], ["updated_at", "2022-12-04 05:28:28.966276"]]
---
  def new
    if request.post?
      shopper = Shopper.new
      shopper.userid = params[:userid]
      shopper.name = params[:name]
      shopper.password = Digest::SHA256.hexdigest(params[:password])[50]
      shopper.email = params[:email]
      shopper.save

SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ?  [["userId", "jenil"]]
---
  def cart
    if params[:back] == "<- Back"
      redirect_to "http://localhost:3000/shopper/index"
    end
    if params[:placeOrder] == "Place Order"
      session["creditCardNo"] = params[:creditCardNo]
      session["address"] = params[:address]
      session["name"] = params[:name]
      redirect_to "http://localhost:3000/shopper/order", notice: "Order placed successfully"
    end
    @userCart = Cart.where(userId: session["userid"])

SELECT "carts".* FROM "carts" WHERE "carts"."userId" = ?  [["userId", "jenil"]]
INSERT INTO "orders" ("orderid", "userid", "productName", "quantity", "price", "created_at", "updated_at", "creditCardNo", "address", "name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 3]]
---
  def order
    userCart = Cart.where(userId: session["userid"])
    generatedOrderId = "order-#{SecureRandom.hex}"
    userCart.each do |cartItem|
      order = Order.new
      order.orderid = generatedOrderId
      order.userid = session[:userid]
      order.productName = cartItem.productName
      order.quantity = cartItem.quantity
      order.price = cartItem.cost
      order.creditCardNo = session["creditCardNo"]
      order.address = session["address"]
      order.name = session["name"]
      order.save
    end
    session.delete(:creditCardNo)
    session.delete(:address)
    session.delete(:name)
    Cart.where(userId: session["userid"]).destroy_all